icssw-org/MeshCom-Firmware/src/esp32/esp32_gps.cpp
        Serial.println("[INIT]...All AXP2101 started");
    }
    else
    {
        Serial.println("[INIT]...Failed to find AXP power management chip");
        delete PMU;
        PMU = NULL;
    }

    delay(100);

    #endif
}

static void persist_last_position_if_needed(void)
{
    static double last_saved_lat = NAN;
    static double last_saved_lon = NAN;
    static unsigned long last_position_save_ms = 0;

    if(isnan(last_saved_lat))
        last_saved_lat = meshcom_settings.node_lat;
    if(isnan(last_saved_lon))
        last_saved_lon = meshcom_settings.node_lon;

    double diff_lat = fabs(meshcom_settings.node_lat - last_saved_lat);
    double diff_lon = fabs(meshcom_settings.node_lon - last_saved_lon);

    const double delta_threshold = 0.00005; // ~5-6 meters
    const unsigned long min_interval_ms = 60000UL;

    unsigned long now = millis();
    bool moved_far = (diff_lat >= delta_threshold) || (diff_lon >= delta_threshold);
    bool interval_elapsed = (last_position_save_ms == 0) || ((now - last_position_save_ms) >= min_interval_ms);

    if(!moved_far && !interval_elapsed)
        return;

    save_settings();
    last_saved_lat = meshcom_settings.node_lat;
    last_saved_lon = meshcom_settings.node_lon;
    last_position_save_ms = now;
}

unsigned int readGPS(void)
{
    #if defined(GPS_WAKEUP)
        pinMode(GPS_WAKEUP, OUTPUT);
        digitalWrite(GPS_WAKEUP, HIGH);
        delay(200);
    #endif
    
     if(bGPSDEBUG)
        Serial.println("-----------check GPS-----------");
  
    bool newData = false;
    unsigned long start = millis();
    unsigned long GPStimeout = millis();
    bool BurstStart = false;

    gpsSerial.flush();

    while ((millis() - start) < 1000)
    {
        while (gpsSerial.available() > 0)
        {
            BurstStart = true;
            GPStimeout = millis();
            char c = gpsSerial.read();
            if(((c>=0x20) && (c<0x7f)) || (c==0x0A) || (c==0x0D))
            {
                if (tinyGPSPlus.encode(c))
                {
                    newData = true;
                }
            }
        }
        if (BurstStart && (GPStimeout+20) < millis()) break;
    }

    if(tinyGPSPlus.satellites.isValid())
    {
        posinfo_satcount = tinyGPSPlus.satellites.value();
        
        if(tinyGPSPlus.hdop.isValid())
            posinfo_hdop = tinyGPSPlus.hdop.value();
        else
            posinfo_hdop = 9099;

        if(bGPSDEBUG)
            Serial.printf("[GPS ]...SAT:%i HDOP:%i\n", posinfo_satcount, posinfo_hdop);
    }

    if(bGPSDEBUG)
    {
        Serial.printf("newData:%i SAT:%d Fix:%d UPD:%d VAL:%d HDOP:%i TIMEVAL:%i\n", newData, tinyGPSPlus.satellites.value(), tinyGPSPlus.sentencesWithFix(), tinyGPSPlus.location.isUpdated(), tinyGPSPlus.location.isValid(), tinyGPSPlus.hdop.value(), tinyGPSPlus.time.isValid());
    }

    if(tinyGPSPlus.date.year() > 2023 && tinyGPSPlus.time.isValid())
    {
        if(bGPSDEBUG)
            Serial.printf("GPS-UTC-Time <local:%.1f %04u-%02u-%02u %02u:%02u:%02u\n", meshcom_settings.node_utcoff, tinyGPSPlus.date.year(), tinyGPSPlus.date.month(), tinyGPSPlus.date.day(), tinyGPSPlus.time.hour(), tinyGPSPlus.time.minute(), tinyGPSPlus.time.second());

        MyClock.setCurrentTime(meshcom_settings.node_utcoff, tinyGPSPlus.date.year(), tinyGPSPlus.date.month(), tinyGPSPlus.date.day(), tinyGPSPlus.time.hour(), tinyGPSPlus.time.minute(), tinyGPSPlus.time.second());
        snprintf(cTimeSource, sizeof(cTimeSource), (char*)"GPS");
    }

    if (newData && tinyGPSPlus.location.isUpdated() && tinyGPSPlus.location.isValid() && tinyGPSPlus.hdop.isValid() && tinyGPSPlus.hdop.value() < 5000)
    {
        meshcom_settings.node_lat = cround4abs(tinyGPSPlus.location.lat());
        meshcom_settings.node_lon = cround4abs(tinyGPSPlus.location.lng());

        if(tinyGPSPlus.location.rawLat().negative)
            meshcom_settings.node_lat_c = 'S';
        else
            meshcom_settings.node_lat_c = 'N';

        if(tinyGPSPlus.location.rawLng().negative)
            meshcom_settings.node_lon_c = 'W';
        else
            meshcom_settings.node_lon_c = 'E';

        meshcom_settings.node_alt = ((meshcom_settings.node_alt * 10) + (int)tinyGPSPlus.altitude.meters()) / 11;

        if(bGPSDEBUG)
        {
            Serial.printf("GPS: LAT:%lf LON:%lf %02d-%02d-%02d %02d:%02d:%02d\n", tinyGPSPlus.location.lat(), tinyGPSPlus.location.lng(), tinyGPSPlus.date.year(), tinyGPSPlus.date.month(), tinyGPSPlus.date.day(), tinyGPSPlus.time.hour(), tinyGPSPlus.time.minute(), tinyGPSPlus.time.second());
            
            //Serial.printf("INT: LAT:%lf LON:%lf %i-%02i-%02i %02i:%02i:%02i\n", meshcom_settings.node_lat, meshcom_settings.node_lon, meshcom_settings.node_date_year, meshcom_settings.node_date_month,  meshcom_settings.node_date_day,
            // meshcom_settings.node_date_hour, meshcom_settings.node_date_minute, meshcom_settings.node_date_second );
        }


        posinfo_satcount = tinyGPSPlus.satellites.value();
        posinfo_hdop = tinyGPSPlus.hdop.value();
        posinfo_fix = true;

        persist_last_position_if_needed();

        return setSMartBeaconing(meshcom_settings.node_lat, meshcom_settings.node_lon);

    }
    else
    {
        posinfo_fix = false;
        posinfo_satcount = 0;
        posinfo_hdop = 0;
    }

    return 0;
}

int gpsBaudrate = GPS_DEFAULT_BAUDRATE;

/// @brief check GPS at Baudrate (OE3WAS)
/// @param Baudrate 
/// @return true if found
bool checkGPS(uint32_t Baudrate)
{
    Serial.printf("GPS: trying %u baud <%i>\n", Baudrate, maxStateCount);
    gpsSerial.begin(Baudrate);

    if (myGPS.begin(gpsSerial))
    {
        Serial.printf("GPS: connected at %u baud\n", Baudrate);
        gpsBaudrate = Baudrate;
        maxStateCount=1;
        return true;
    }
    myGPS.end();
    gpsSerial.end();
    delay(100);
    return false;
}

unsigned int getGPS(void)
{
    if(!bGPSON)
    {
        if(meshcom_settings.node_postime > 0)
            return (unsigned long)meshcom_settings.node_postime;

