icssw-org/MeshCom-Firmware/src/esp32/esp32_gps.cpp
        posinfo_fix = false;
        posinfo_satcount = 0;
        posinfo_hdop = 0;

        return POSINFO_INTERVAL;
    }

    if(bMitHardReset)
    {
        Serial.print("===== STATE ");
        Serial.println(state);
    }

    #if defined (BOARD_TRACKER)
        if(gpsSerial.available() > 0)
        {
            return readGPS();
        }
        
        gpsSerial.begin(GPS_BAUDRATE_MODUL, SERIAL_8N1, GPS_TX_PIN, GPS_RX_PIN);
        
        return POSINFO_INTERVAL;
    #endif

    #if defined GPS_BAUDRATE
        gpsBaudrate = GPS_BAUDRATE;
    #endif

    bool bw=true;

    switch (state)
    {
        case 0: // auto-baud connection, then switch to 38400 and save config
            
            while(bw)
            {
                if (checkGPS(gpsBaudrate)) //priorisierte Baudrate zuerst testen
                {
                    bw=false;
                }
                else
                if (checkGPS(9600))
                {
                    bw=false;
                }
                else
                if (checkGPS(38400))
                {
                    bw=false;
                }
                else
                if (checkGPS(57600))
                {
                    bw=false;
                }
                else
                if (checkGPS(115200))
                {
                    bw=false;
                }

                delay(200); //Wait a bit before trying again to limit the Serial output flood
                maxStateCount++;

                if(maxStateCount > 10)
                    return POSINFO_INTERVAL;
            }

            if(bGPSON)
            {
                myGPS.setUART1Output(COM_TYPE_NMEA); //Set the UART port to output NMEA only
                delay(100);
                myGPS.enableNMEAMessage(UBX_NMEA_GLL, COM_PORT_UART1);
                delay(100);
                myGPS.enableNMEAMessage(UBX_NMEA_GSA, COM_PORT_UART1);
                delay(100);
                myGPS.enableNMEAMessage(UBX_NMEA_RMC, COM_PORT_UART1);
                delay(100);
                myGPS.enableNMEAMessage(UBX_NMEA_VTG, COM_PORT_UART1);
                delay(100);
                myGPS.enableNMEAMessage(UBX_NMEA_GGA, COM_PORT_UART1);
                delay(100);
                myGPS.setMeasurementRate(1000);
                delay(100);
                myGPS.saveConfiguration(); //Save the current settings to flash and BBR
                delay(100);

                if(gpsBaudrate != GPS_BAUDRATE)
                {
                    myGPS.setSerialRate(GPS_BAUDRATE, COM_PORT_UART1);
    
                    gpsSerial.end();
                    delay(100);
                    gpsSerial.begin(GPS_BAUDRATE);
                    delay(100);
    
                    myGPS.saveConfiguration();
                    delay(100);
                }

                Serial.println("GPS serial connected, saved config");
                
                state++;
            }
            
            break;
            
        case 1: // hardReset, expect to see GPS back at 38400 baud
            if(bMitHardReset)
            {
                Serial.println("Issuing hardReset (cold start)");

                myGPS.hardReset();
                delay(3000);
                gpsSerial.begin(gpsBaudrate);

                if (myGPS.begin(gpsSerial))
                {
                    Serial.println("Success.");
                }
                else
                {
                    Serial.printf("*** GPS did not respond at %i baud, starting over.\n", gpsBaudrate);
                    state = 2;
                    //bMitHardReset=false;
                    break;
                }
            }

            state++;

            break;
            
        case 2: // factoryReset, expect to see GPS back at gpsBaudrate baud
            if(bMitHardReset)
            {
                Serial.println("Issuing factoryReset");

                myGPS.factoryReset();
                delay(3000); // takes more than one second... a loop to resync would be best
                gpsSerial.begin(gpsBaudrate);

                if (myGPS.begin(gpsSerial))
                {
                    Serial.println("Success.");
                } else {
                    Serial.printf("*** GPS did not come back at %i baud, starting over.\n", gpsBaudrate);
                    state = 0;
                    bMitHardReset=false;
                    break;
                }
            }
        
            state++;

            break;
            
        case 3: // print version info
            if(bMitHardReset)
            {
                /*
                Serial.print("GPS protocol version: ");
                Serial.print(myGPS.getProtocolVersionHigh());
                Serial.print('.');
                Serial.println(myGPS.getProtocolVersionLow());
                Serial.println();
                */
            
                Serial.println("GPS running");
            }
            
            state++;
            bMitHardReset=false;

            break;
        
        case 4:
            if(gpsSerial.available() > 0)
            {
                return readGPS();
            }

    }

    return POSINFO_INTERVAL;
}

#endif
